{
  "exported_at": "2025-09-04T00:58:54.567497",
  "total_items": 5,
  "items": [
    {
      "name": "Abracadabrus",
      "description": "Source: Icewind Dale - Rime of the Frostmaiden\n\nWondrous item, very rare\n\nAnabracadabrusis an ornate, gemstone-studded wooden chest that weighs 25 pounds while empty. Its interior compartment is a cube measuring 1 1/2 feet on a side.\n\nThe chest has 20 charges. A creature can use an action to touch the closed lid of the chest and expend 1 of the chest's charges while naming one or more nonmagical objects (including raw materials, foodstuffs, and liquids) worth a total of 1 gp or less. The named objects magically appear in the chest, provided they can all fit inside it and the chest doesn't contain anything else. For example, the chest can conjure a plate of strawberries, a bowl of hot soup, a flagon of water, a stuffed animal, or a bag of twenty caltrops. Food and drink conjured by the chest are delicious, and they spoil if not consumed after 24 hours. Gems and precious metals created by the chest disappear after 1 minute.\n\nThe chest regains 1d20 expended charges daily at dawn. If the item's last charge is expended, roll a d20. On a 1, the chest loses its magic (becoming an ordinary chest), and its gemstones turn to dust.",
      "rarity": "Very Rare",
      "type": "Wondrous Item",
      "description_length": 1138
    },
    {
      "name": "Absorbing Tattoo",
      "description": "Source: Tasha's Cauldron of Everything\n\nWondrous item (tattoo), very rare (requires attunement)\n\nProduced by a special needle, this magic tattoo features designs that emphasize one color.\n\nTattoo Attunement.To attune to this item, you hold the needle to your skin where you want the tattoo to appear, pressing the needle there throughout the attunement process. When the attunement is complete, the needle turns into the ink that becomes the tattoo, which appears on the skin.\n\nIf your attunement to the tattoo ends, the tattoo vanishes, and the needle reappears in your space.\n\nDamage Resistance.While the tattoo is on your skin, you have resistance to a type of damage associated with that color, as shown on the table below. The DM chooses the color or determines it randomly.\n\nDamage Absorption.When you take damage of the chosen type, you can use your reaction to gain immunity against that instance of the damage, and you regain a number of hit points equal to half the damage you would have taken. Once this reaction is used, it can't be used again until the next dawn.",
      "rarity": "Very Rare",
      "type": "Wondrous Item",
      "description_length": 1076
    },
    {
      "name": "Acheron Blade",
      "description": "Source: Explorer's Guide to Wildemount\n\nWeapon (any sword), rare (requires attunement)\n\nThe black blade of this sword is crafted from a mysterious arcane alloy. You gain a +1 bonus to attack and damage rolls made with this magic weapon. While the sword is on your person, you are immune to effects that turn undead.\n\nDark Blessing.While holding the sword, you can use an action to give yourself 1d4 + 4 temporary hit points. This property can't be used again until the next dusk.\n\nDisheartening Strike.When you hit a creature with an attack using this weapon, you can fill the target with unsettling dread: the target has disadvantage on the next saving throw it makes before the end of your next turn. The creature ignores this effect if it's immune to the frightened condition. Once you use this property, you can't do so again until the next dusk.",
      "rarity": "Rare",
      "type": "Weapon",
      "description_length": 850
    },
    {
      "name": "Adamantine Armor",
      "description": "Source: Dungeon Master's Guide\n\nArmor (medium or heavy, but not hide), uncommon\n\nThis suit of armor is reinforced with adamantine, one of the hardest substances in existence. While you're wearing it, any critical hit against you becomes a normal hit.",
      "rarity": "Uncommon",
      "type": "Armor",
      "description_length": 250
    },
    {
      "name": "Adze of Annam",
      "description": "Source: Bigby Presents - Glory of the Giants\n\nWeapon (Greataxe), Artifact (Requires Attunement)\n\nThis massive adze is said to have been wielded by All-Father Annam, not as a weapon but as the tool he used to shape the various worlds of the Material Plane eons ago.\n\nRandom Properties.The adze has the following random properties, determined by rolling on the appropriate table in theDungeon Master's Guide:\n\nMagic Weapon.When a creature attunes to the adze, the artifact magically adjusts its size so that creature can wield it as a greataxe. The adze is a magic weapon that grants a +3 bonus to attack and damage rolls made with it. On a hit, the adze deals an additional 3d12 force damage. It also deals double damage to objects and structures.\n\nDivine Mattock.As an action, you can call upon the might of the All-Father and use the adze to castMove EarthorFabricate. Once this property is used, it can't be used again until the next dawn.",
      "rarity": "Artifact",
      "type": "Weapon",
      "description_length": 941
    }
  ]
}